from fastapi.testclient import TestClient
from reservoir import app

client = TestClient(app)

def test_reservoir_fetch():
    response = client.post("/reservoir_fetch/", json = {
                                "year_to": 2023,
                                "month_to": 5,
                                "day_to": 1,
                                "hour_to": 0,
                                "past_hours": 1,
                                "reservoir_names": ["曾文水庫", "石門水庫"]
                            },
                           headers = {
                               "Content-Type": "application/json"
                           }
                           )
    assert response.status_code == 200
    assert response.json() == {"data":[{"水庫名稱":"曾文水庫","時間":["2023-04-30 23:00:00","2023-05-01 00:00:00"],"本日集水區累積降雨量(mm)":[0,0],"進流量(cms)":[-1,-1],"水位(公尺)":[190.26,190.26],"滿水位(公尺)":[230,230],"有效蓄水量(萬立方公尺)":[3258,3258],"蓄水百分比(%)":[6.43,6.43],"取水流量(cms)":[-1,-1],"發電放水口":["-1.0","-1.0"],"排砂道/PRO":["-1.0","-1.0"],"排洪隧道":["-1.0","-1.0"],"溢洪道":["-1.0","-1.0"],"其他":["-1.0","-1.0"],"小計":[-1,-1],"目前狀態":["-1.0","-1.0"],"預定時間":["-1.0","-1.0"],"預定放流量(cms)":[-1,-1]},{"水庫名稱":"石門水庫","時間":["2023-04-30 23:00:00","2023-05-01 00:00:00"],"本日集水區累積降雨量(mm)":[-1,-1],"進流量(cms)":[-1,-1],"水位(公尺)":[226.98,226.97],"滿水位(公尺)":[245,245],"有效蓄水量(萬立方公尺)":[8037.5,8032.53],"蓄水百分比(%)":[39.16,39.13],"取水流量(cms)":[-1,-1],"發電放水口":["-1.0","-1.0"],"排砂道/PRO":["-1.0","-1.0"],"排洪隧道":["-1.0","-1.0"],"溢洪道":["-1.0","-1.0"],"其他":["-1.0","-1.0"],"小計":[-1,-1],"目前狀態":["-1.0","-1.0"],"預定時間":["-1.0","-1.0"],"預定放流量(cms)":[-1,-1]}]}
    
    response = client.post("/reservoir_fetch/", json = {
                                "year_to": 2023,
                                "month_to": 5,
                                "day_to": 1,
                                "hour_to": 0,
                                "year_from": 2022,
                                "month_from": 5,
                                "day_from": 1,
                                "hour_from": 12,
                                "past_hours": 1,
                                "reservoir_names": ["曾文水庫", "石門水庫"]
                            },
                           headers = {
                               "Content-Type": "application/json"
                           }
                           )
    assert response.status_code == 200
    assert response.json() == {"data":[{"水庫名稱":"曾文水庫","時間":["2023-04-30 23:00:00","2023-05-01 00:00:00"],"本日集水區累積降雨量(mm)":[0,0],"進流量(cms)":[-1,-1],"水位(公尺)":[190.26,190.26],"滿水位(公尺)":[230,230],"有效蓄水量(萬立方公尺)":[3258,3258],"蓄水百分比(%)":[6.43,6.43],"取水流量(cms)":[-1,-1],"發電放水口":["-1.0","-1.0"],"排砂道/PRO":["-1.0","-1.0"],"排洪隧道":["-1.0","-1.0"],"溢洪道":["-1.0","-1.0"],"其他":["-1.0","-1.0"],"小計":[-1,-1],"目前狀態":["-1.0","-1.0"],"預定時間":["-1.0","-1.0"],"預定放流量(cms)":[-1,-1]},{"水庫名稱":"石門水庫","時間":["2023-04-30 23:00:00","2023-05-01 00:00:00"],"本日集水區累積降雨量(mm)":[-1,-1],"進流量(cms)":[-1,-1],"水位(公尺)":[226.98,226.97],"滿水位(公尺)":[245,245],"有效蓄水量(萬立方公尺)":[8037.5,8032.53],"蓄水百分比(%)":[39.16,39.13],"取水流量(cms)":[-1,-1],"發電放水口":["-1.0","-1.0"],"排砂道/PRO":["-1.0","-1.0"],"排洪隧道":["-1.0","-1.0"],"溢洪道":["-1.0","-1.0"],"其他":["-1.0","-1.0"],"小計":[-1,-1],"目前狀態":["-1.0","-1.0"],"預定時間":["-1.0","-1.0"],"預定放流量(cms)":[-1,-1]}]}
    
    response = client.post("/reservoir_fetch/", json = {
                                "year_to": 2023,
                                "month_to": 5,
                                "day_to": 1,
                                "hour_to": 0,
                                "year_from": 2023,
                                "month_from": 6,
                                "day_from": 1,
                                "hour_from": 12,
                                "reservoir_names": ["曾文水庫", "石門水庫"]
                            },
                           headers = {
                               "Content-Type": "application/json"
                           }
                           )
    assert response.status_code == 200
    assert response.json() == {"data": []}
    